### [퀴즈1]
#### [문제] 다음은 대한민국 영화 중에서 관객 수가 가장 많은 상위 10 개의 데이터입니다.
#### 주어진 코드를 이용하여 퀴즈를 풀어보세요

In [1]:
import pandas as pd
import numpy as np

In [69]:
data = {
    "영화" : ['명량', '극한직업', '신과함께-죄와 벌', '국제시장', '베테랑', '괴물', '도둑들', '7번방의 선물', '암살', '광해, 왕이 된 남자'],
    "개봉 연도" : ['2014', '2019', '2017','2014' ,'2015', '2006', '2012', '2013', '2015', '2012'],
    "관객 수" : [1761, 1626, 1441, 1425, 1341, 1301, 1298, 1281, 1270, 1231],
    "평점" : [8.88, 9.20, 8.73, 9.16, 9.24, 8.62, 7.64, 8.83, 9.10, 9.25]
}
df = pd.DataFrame(data)
df

            영화 개봉 연도  관객 수    평점
0           명량  2014  1761  8.88
1         극한직업  2019  1626  9.20
2    신과함께-죄와 벌  2017  1441  8.73
3         국제시장  2014  1425  9.16
4          베테랑  2015  1341  9.24
5           괴물  2006  1301  8.62
6          도둑들  2012  1298  7.64
7      7번방의 선물  2013  1281  8.83
8           암살  2015  1270  9.10
9  광해, 왕이 된 남자  2012  1231  9.25

In [75]:
df['개봉 연도'] = df['개봉 연도'].astype('int64')

#### 1) 전체 데이터 중에서 '영화' 정보만 출력하기

In [70]:
df['영화'].to_list()

['명량',
 '극한직업',
 '신과함께-죄와 벌',
 '국제시장',
 '베테랑',
 '괴물',
 '도둑들',
 '7번방의 선물',
 '암살',
 '광해, 왕이 된 남자']

#### 2) 전체 데이터 중에서 '영화','평점' 정보 출력하기

In [5]:
df[['영화', '평점']]

            영화    평점
0           명량  8.88
1         극한직업  9.20
2    신과함께-죄와 벌  8.73
3         국제시장  9.16
4          베테랑  9.24
5           괴물  8.62
6          도둑들  7.64
7      7번방의 선물  8.83
8           암살  9.10
9  광해, 왕이 된 남자  9.25

#### 3) 2015년 이후에 개봉한 영화 데이터 중에서 '영화','개봉연도' 정보만 출력하기

In [77]:
df.loc[df['개봉 연도'] > 2015, ['영화', '개봉 연도']]
df[df['개봉 연도'] > 2015][['영화', '개봉 연도']]

          영화  개봉 연도
1       극한직업   2019
2  신과함께-죄와 벌   2017

#### 4) 주어진 계산식을 참고하여 '추천점수' 컬럼 추가
> 추천점수 = (관객수 * 평점) // 100

In [23]:
df['추천점수'] = (df['관객 수'] * df['평점']) // 100

#### 5) 전체 데이터를 '개봉 연도' 기준 내림차순으로 출력하기

In [24]:
df.sort_values('개봉 연도', ascending=False)

            영화  개봉 연도  관객 수    평점   추천점수
1         극한직업   2019  1626  9.20  149.0
2    신과함께-죄와 벌   2017  1441  8.73  125.0
4          베테랑   2015  1341  9.24  123.0
8           암살   2015  1270  9.10  115.0
0           명량   2014  1761  8.88  156.0
3         국제시장   2014  1425  9.16  130.0
7      7번방의 선물   2013  1281  8.83  113.0
6          도둑들   2012  1298  7.64   99.0
9  광해, 왕이 된 남자   2012  1231  9.25  113.0
5           괴물   2006  1301  8.62  112.0

### [퀴즈2]

In [79]:
df = pd.DataFrame({
    'name' : ['홍길동', '김수정', '이민정'],
    'age' : [25, 35, 45]
})
df

  name  age
0  홍길동   25
1  김수정   35
2  이민정   45

#### 1) 현재 생성된 데이터프레임의 전체 정보 출력

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

#### 2) 타입 변경
- age 컬럼을 이용하여 age_1 컬럼을 생성하고 타입은 int64로 변경

In [88]:
df['age_1'] = df['age'].astype('int64')
df['age_2'] = pd.to_numeric(df['age'])
df

  name  age  age_1  age_2
0  홍길동   25     25     25
1  김수정   35     35     35
2  이민정   45     45     45

### [퀴즈3]

In [30]:
df = pd.DataFrame({
    "국어" : [15, 25, 35, 35],
    "영어" : [45, 55, np.nan, np.nan],
    "수학" : [75, 85, 56, 56],
    "미술" : [77, np.nan, 96, 96]
}, index=["1월", "2월", "3월", "4월"])
df

    국어    영어  수학    미술
1월  15  45.0  75  77.0
2월  25  55.0  85   NaN
3월  35   NaN  56  96.0
4월  35   NaN  56  96.0

#### 1) 컬럼명 변경 : 국어,영어,수학,과학

In [31]:
df['미술'].rename('과학', inplace=True)

1월    77.0
2월     NaN
3월    96.0
4월    96.0
Name: 과학, dtype: float64

#### 2) 중복 행 제거한 후 새로운 데이터프레임(df2)으로 저장

In [33]:
df2 = df.drop_duplicates()
df2

    국어    영어  수학    미술
1월  15  45.0  75  77.0
2월  25  55.0  85   NaN
3월  35   NaN  56  96.0

#### 3) 특정 컬럼값이 중복되면 제거

In [34]:
df.drop_duplicates('영어')

    국어    영어  수학    미술
1월  15  45.0  75  77.0
2월  25  55.0  85   NaN
3월  35   NaN  56  96.0

### [퀴즈4]

#### 1) data/shop/olist_customers_dataset.csv 파일 dataframe 생성 (데이터프레임 변수 이름은 customer 로  지정)

In [35]:
customer = pd.read_csv('../data/shop/olist_customers_dataset.csv')

#### 2) 처음 5개 행 확인

In [36]:
customer.head()

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
0,06b8999e2fba1a1fbc88172c00ba8bc7,861eff4711a542e4b93843c6dd7febb0,14409,franca,SP
1,18955e83d337fd6b2def6b18a428ac77,290c77bc529b7ac935b93aa66c333dc3,9790,sao bernardo do campo,SP
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
3,b2b6027bc5c5109e529d4dc6358b12c3,259dac757896d24d7702b9acbbff3f3c,8775,mogi das cruzes,SP
4,4f2d8ab171c80ec8364f7c12e35b23ad,345ecd01c38d18a9036ed96c73b8d066,13056,campinas,SP

#### 3) 전체 record 수(행 수) 확인하기

In [89]:
customer.shape[0]

99441

#### 4) 전체 정보 확인하기

In [40]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  int64
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

#### 5) 전체 컬럼명 확인

In [41]:
customer.columns

Index(['customer_id', 'customer_unique_id', 'customer_zip_code_prefix',
       'customer_city', 'customer_state'],
      dtype='object')

#### 6) 인덱스 확인

In [42]:
customer.index

RangeIndex(start=0, stop=99441, step=1)

#### 7) 기술통계요약 정보 확인

In [43]:
customer.describe()

       customer_zip_code_prefix
count              99441.000000
mean               35137.474583
std                29797.938996
min                 1003.000000
25%                11347.000000
50%                24416.000000
75%                58900.000000
max                99990.000000

#### 8) customer_zip_code_prefix, customer_city, customer_state 컬럼만 가져와서 데이터 프레임 생성 (데이터프레임 변수 이름은 customer2로 하기로 함)

In [90]:
customer2 = customer[["customer_zip_code_prefix","customer_city" , "customer_state"]]
customer2

       customer_zip_code_prefix          customer_city customer_state
0                         14409                 franca             SP
1                          9790  sao bernardo do campo             SP
2                          1151              sao paulo             SP
3                          8775        mogi das cruzes             SP
4                         13056               campinas             SP
...                         ...                    ...            ...
99436                      3937              sao paulo             SP
99437                      6764        taboao da serra             SP
99438                     60115              fortaleza             CE
99439                     92120                 canoas             RS
99440                      6703                  cotia             SP

[99441 rows x 3 columns]

#### 9)  customer_city 가 sao paulo 인 레코드(행)만 가져와서 데이터프레임 생성(변수 이름은 customer3 으로 지정)
- 레코드(행) 수 확인도 해보기

In [92]:
customer3 = customer[customer["customer_city"] == 'sao paulo'].copy()
customer3

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_city,customer_state
2,4e7b3e00288586ebd08712fdd0374a03,060e732b5b29e8181a18229c7b0b2b5e,1151,sao paulo,SP
6,fd826e7cf63160e536e0908c76c3f441,addec96d2e059c80c30fe6871d30d177,4534,sao paulo,SP
13,eabebad39a88bb6f5b52376faec28612,295c05e81917928d76245e842748184d,5704,sao paulo,SP
18,9b8ce803689b3562defaad4613ef426f,7f3a72e8f988c6e735ba118d54f47458,5416,sao paulo,SP
22,2938121a40a20953c43caa8c98787fcb,482441ea6a06b1f72fe9784756c0ea75,5713,sao paulo,SP
...,...,...,...,...,...
99408,f6c6d3e1e20969a5eed982163f959719,fb354969e06f2093c0083cbfbb91864e,1521,sao paulo,SP
99411,da37711b17efd5f2539e8196ab215f04,5f2971f9805e3ccb030226e30c8e8390,4313,sao paulo,SP
99422,821a7275a08f32975caceff2e08ea262,046470763123d3d6364f89095b4e47ab,5734,sao paulo,SP
99423,c6ece8a5137f3c9c3a3a12302a19a2ac,aaf22868003377e859049dcf5f0b3fdf,1323,sao paulo,SP
99436,17ddf5dd5d51696bb3d7c6291687be6f,1a29b476fee25c95fbafc67c5ac95cf8,3937,sao paulo,SP

In [93]:
customer3.shape[0]

15540

#### 10) customer2 에서 도시별 고유 값들의 수를 확인하기

In [98]:
customer2['customer_city'].value_counts()

sao paulo            15540
rio de janeiro        6882
belo horizonte        2773
brasilia              2131
curitiba              1521
                     ...
bequimao                 1
andarai                  1
vargem grande            1
curvelandia              1
eugenio de castro        1
Name: customer_city, Length: 4119, dtype: int64

#### 11) customer 데이터프레임에서 customer_city 기준으로 행의 갯수를 확인
1. 새로운 데이터프레임 변수 이름은 customer4로 지정

In [99]:
customer4 = customer.groupby('customer_city').count()

In [100]:
customer4.shape[0]

4119

#### 12) customer4에서 가장 레코드(행)의 수가 많은 customer_city 를 확인해보세요
1. customer4의 customer_id 를 기준으로 정렬하고, 가장 상단의 한 행만 출력하기

In [103]:
customer4.sort_values('customer_id', ascending=False).head(1)

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_state
customer_city,,,,
sao paulo,15540,15540,15540,15540

#### 13) customer 에서 customer_city 를 인덱스로 만들고, 알파벳 순으로 인덱스를 정렬해보세요

In [105]:
customer.set_index('customer_city').sort_index()

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_state
customer_city,,,,
abadia dos dourados,a23e3f9a2b656b23b7e52075964b42cd,afddf43a03a9941624ed42c0b2c17280,38540,MG
abadia dos dourados,9e01f714a2b3b8962c222cf2b74c20dc,e1feae9083c4c2895ddf6dc80526a85d,38540,MG
abadia dos dourados,f11eb8f0b8b87510a93e3e1aa10b0ade,64ee476500a01beb94df40f97a108c50,38540,MG
abadiania,576d71ddb21b21763cfedce73b902180,8d76b559181609308fcae630ea64cd61,72940,GO
abaete,5e9e1ae42e02df93e9a591e86fd531a3,28af9604f7830ef6d1230fb575c39eb1,35620,MG
...,...,...,...,...
ze doca,1052e334b46dd1e9876946d6372a363e,c933181d09535cb6bdfb1c0160323bd9,65365,MA
ze doca,d8b3ef6f73de33ae716e94d2478cc080,9ef06526b8e57a567ed6f1dce7ab0320,65365,MA
ze doca,fc87e5c06780700952aa42998a22968f,d4798889fe74026a739ca0be9d2dccb8,65365,MA
zortea,0a466d490a3c2fcc1e7177f4809ec7dd,d5a5ceb83234eeb855268d7fce7f54ea,89633,SC
zortea,e046f992a304cc92e1b00d7fccdf1c42,09a3f87b74828b274d73ee9dfef43b68,89633,SC

#### 14) customer2에서 customer_state 기준으로 행의 갯수를 확인해보세요
- value_counts()

In [109]:
customer2['customer_state'].value_counts()

SP    41746
RJ    12852
MG    11635
RS     5466
PR     5045
SC     3637
BA     3380
DF     2140
ES     2033
GO     2020
PE     1652
CE     1336
PA      975
MT      907
MA      747
MS      715
PB      536
PI      495
RN      485
AL      413
SE      350
TO      280
RO      253
AM      148
AC       81
AP       68
RR       46
Name: customer_state, dtype: int64

#### 15) customer2에서 customer_state 갯수 확인

In [111]:
customer2['customer_state'].count()

99441

#### 16) customer4에서 customer_id 갯수가 1000개 이상인 정보 추출하기

In [115]:
customer4[customer4['customer_id'] >= 1000]

,customer_id,customer_unique_id,customer_zip_code_prefix,customer_state
customer_city,,,,
belo horizonte,2773,2773,2773,2773
brasilia,2131,2131,2131,2131
campinas,1444,1444,1444,1444
curitiba,1521,1521,1521,1521
guarulhos,1189,1189,1189,1189
porto alegre,1379,1379,1379,1379
rio de janeiro,6882,6882,6882,6882
salvador,1245,1245,1245,1245
sao paulo,15540,15540,15540,15540

#### 17) customer4에서 customer_id 갯수가 1000개 이상인 customer_city 이름을 확인해보세요

In [119]:
customer4[customer4['customer_id'] >= 1000].index

Index(['belo horizonte', 'brasilia', 'campinas', 'curitiba', 'guarulhos',
       'porto alegre', 'rio de janeiro', 'salvador', 'sao paulo'],
      dtype='object', name='customer_city')

#### 18) customer에서 결측치가 각 컬럼에 있는지 확인

In [124]:
customer.isnull().sum()

customer_id                 0
customer_unique_id          0
customer_zip_code_prefix    0
customer_city               0
customer_state              0
dtype: int64

In [121]:
customer.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99441 entries, 0 to 99440
Data columns (total 5 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   customer_id               99441 non-null  object
 1   customer_unique_id        99441 non-null  object
 2   customer_zip_code_prefix  99441 non-null  int64
 3   customer_city             99441 non-null  object
 4   customer_state            99441 non-null  object
dtypes: int64(1), object(4)
memory usage: 3.8+ MB

#### 19) customer에서 중복된 customer_city 를 가진 행을 삭제한 후, customer_city 이름만 가져와보세요

In [123]:
customer.drop_duplicates('customer_city')[["customer_city"]]

               customer_city
0                     franca
1      sao bernardo do campo
2                  sao paulo
3            mogi das cruzes
4                   campinas
...                      ...
98878                 siriji
99114    natividade da serra
99224           monte bonito
99251             sao rafael
99379      eugenio de castro

[4119 rows x 1 columns]

### [퀴즈5]

#### 1) data/covid/04-01-2020.csv 파일 dataframe 생성 (데이터프레임 변수 이름은 covid_df 로  지정)

In [125]:
covid_df = pd.read_csv('../data/covid/04-01-2020.csv')
covid_df

,FIPS,Admin2,Province_State,Country_Region,Last_Update,Lat,Long_,Confirmed,Deaths,Recovered,Active,Combined_Key
0,45001.0,Abbeville,South Carolina,US,2020-04-01 21:58:49,34.223334,-82.461707,4,0,0,0,"Abbeville, South Carolina, US"
1,22001.0,Acadia,Louisiana,US,2020-04-01 21:58:49,30.295065,-92.414197,47,1,0,0,"Acadia, Louisiana, US"
2,51001.0,Accomack,Virginia,US,2020-04-01 21:58:49,37.767072,-75.632346,7,0,0,0,"Accomack, Virginia, US"
3,16001.0,Ada,Idaho,US,2020-04-01 21:58:49,43.452658,-116.241552,195,3,0,0,"Ada, Idaho, US"
4,19001.0,Adair,Iowa,US,2020-04-01 21:58:49,41.330756,-94.471059,1,0,0,0,"Adair, Iowa, US"
...,...,...,...,...,...,...,...,...,...,...,...,...
2478,NaN,NaN,NaN,Venezuela,2020-04-01 21:58:34,6.423800,-66.589700,143,3,41,99,Venezuela
2479,NaN,NaN,NaN,Vietnam,2020-04-01 21:58:34,14.058324,108.277199,218,0,63,155,Vietnam
2480,NaN,NaN,NaN,West Bank and Gaza,2020-04-01 21:58:34,31.952200,35.233200,134,1,18,115,West Bank and Gaza
2481,NaN,NaN,NaN,Zambia,2020-04-01 21:58:34,-13.133897,27.849332,36,0,0,36,Zambia
2482,NaN,NaN,NaN,Zimbabwe,2020-04-01 21:58:34,-19.015438,29.154857,8,1,0,7,Zimbabwe

#### 2) covid_df 에서 중복된 Country_Region 각각에 대해 Confirmed 를 모두 더한 값을 컬럼으로 갖는 데이터프레임을 피봇테이블 작성

In [127]:
pd.pivot_table(covid_df, index='Country_Region', values='Confirmed', aggfunc='sum')

                    Confirmed
Country_Region
Afghanistan               237
Albania                   259
Algeria                   847
Andorra                   390
Angola                      8
...                       ...
Venezuela                 143
Vietnam                   218
West Bank and Gaza        134
Zambia                     36
Zimbabwe                    8

[180 rows x 1 columns]

#### 3) covid_df 에서 중복된 Country_Region 각각에 대해 Confirmed 를 모두 더한 값을 컬럼으로 갖는 데이터프레임을 피봇테이블로  만들고, 총 값을 'Total' 을 인덱스 값으로 하는 record 로 추가하세요
- 결측치는 0으로 처리

In [128]:
pd.pivot_table(covid_df, index='Country_Region', values='Confirmed', aggfunc='sum', margins_name='Total', margins=True, fill_value=0)

                    Confirmed
Country_Region
Afghanistan               237
Albania                   259
Algeria                   847
Andorra                   390
Angola                      8
...                       ...
Vietnam                   218
West Bank and Gaza        134
Zambia                     36
Zimbabwe                    8
Total                  932605

[181 rows x 1 columns]